docs/lisp-ide-compiler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-30 Fri 02:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting up your Lisp environment</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Philip Dumaresq" />
<link rel="stylesheet" type="text/css" href="https://comp-348.github.io/assets/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Setting up your Lisp environment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3bd48e8">Compilers</a></li>
<li><a href="#orgba1d466">Text Editors</a>
<ul>
<li><a href="#orgd03c5db">Emacs</a></li>
<li><a href="#org94abf4b">Visual Studio Code</a>
<ul>
<li><a href="#org7334290">Terminal</a></li>
<li><a href="#org9ae43bc">Integrated into vscode</a></li>
</ul>
</li>
<li><a href="#orgad73dbe">Atom</a></li>
<li><a href="#orgdeb91ac">Vim</a></li>
<li><a href="#orgdd08a63">Portacle</a></li>
<li><a href="#orga567c39">Other</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="index.html">Back</a>
</p>
</div>

<p>
There are tons of different environments that you can use for writing Common Lisp code, in this
guide I outline how to set up some of the most common ones.
</p>

<p>
For Common Lisp, you can use either an online text-editor or an IDE locally on your computer. While
the Swish-Prolog environment works great for Prolog, the online editors for Lisp don&rsquo;t really meet
the same standard. If you&rsquo;d like and you don&rsquo;t want to bother with setting up a local environment,
then you can use either the <a href="https://www.tutorialspoint.com/execute_lisp_online.php">tutorialspoint.com</a> editor or <a href="https://rextester.com/l/common_lisp_online_compiler">rextester</a>.
</p>

<p>
If you&rsquo;d like to set up a local environment, then you can follow down below.
</p>

<div id="outline-container-org3bd48e8" class="outline-2">
<h2 id="org3bd48e8">Compilers</h2>
<div class="outline-text-2" id="text-org3bd48e8">
<p>
There are many compilers available for Common Lisp including Steel Bank Common Lisp, Clozure Common
Lisp, CLisp and more. I would recommend that you use Steel Bank Common Lisp. While for the most part
it won&rsquo;t really matter what you&rsquo;re using, Steel Bank Common Lisp runs on every platform, is widely
used and is what I assume you&rsquo;re using throughout most of the guides in this website. While it
should be mostly the same for any other compiler, some differences may exist, so to simply things I
would recommend simply sticking to SBCL.
</p>
</div>
</div>

<div id="outline-container-orgba1d466" class="outline-2">
<h2 id="orgba1d466">Text Editors</h2>
<div class="outline-text-2" id="text-orgba1d466">
<p>
When it comes to the text editor that you use, there&rsquo;s a lot more variation. I can&rsquo;t cover how to
set up your environment for every text editor, so I&rsquo;m going to stick to the most common ones being
vscode, Atom and Emacs.
</p>
</div>

<div id="outline-container-orgd03c5db" class="outline-3">
<h3 id="orgd03c5db">Emacs</h3>
<div class="outline-text-3" id="text-orgd03c5db">
<p>
Emacs is going to be the best text editor for Common Lisp. <i>However</i> emacs will also require you to do
some learning as it is more complicated than vscode or Atom. If you&rsquo;d like to use Emacs, then I
would recommend installing <a href="https://spacemacs.org">Spacemacs</a> which is an Emacs configuration that gives you a comfortable
experience out of the box. Without it, Emacs is a weird and confusing esoteric text editor that is
very difficult to learn. To start using Spacemacs, just clone the GitHub repository to your home
directory and you&rsquo;re good to go. To do that, it should be something like this:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ <span style="color: #ECBE7B;">git</span> clone https://github.com/syl20bnr/spacemacs ~/.emacs.d
</pre>
</div>

<p>
Then, you need to install actual Emacs. Spacemacs is just a set of configuration files for Emacs and
doesn&rsquo;t ship with Emacs itself. The instructions to install Emacs for Windows, MacOS and Linux can
be found on the <a href="https://www.gnu.org/software/emacs/download.html">Emacs website</a>.
</p>

<p>
Once installed, running Emacs should start up the Spacemacs configuration.
</p>

<p>
Once Spacemacs is done installing everything, it will prompt you a couple of times for basic things
you want in your configuration. The only one that will really matter to you is whether you want to
use Emacs keybindings or Evil-mode. If you know Vim, use evil-mode. If you don&rsquo;t know Vim, I would
still recommend evil-mode if you&rsquo;re willing to do a little bit more learning.
</p>

<p>
Once installed, open up your Common Lisp file. Spacemacs will ship with a package called SLIME
(Superior Lisp Interaction Mode for Emacs) which is what you use in Emacs for executing your Lisp
code. After opening your file, hit <code>SPC m s i</code>  to start SLIME. You&rsquo;ll see another window open, and
that&rsquo;s where you&rsquo;re going to execute your code. If you hit the keys <code>SPC m c l</code> then your entire file
will be compiled and you can navigate over to the other window to call your functions from the file.
For example, if I have the following file:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">add</span> <span style="color: #c678dd;">(</span>a b<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>+ a b<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>x <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>y <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print <span style="color: #98be65;">(</span>add x y<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And I start SLIME with <code>SPC m s i</code> and then load the file, then it will first print out the sum of 10
and 20, then put you in a REPL where you can interact with the program. So you can do <code>(add 10 20)</code>
and it&rsquo;ll have that file compiled and loaded into the running process. To make changes to your code
you can just go back to your file and hit <code>SPC m c l</code> again to re-load the whole file. If you only
want to reload the function you&rsquo;ve changed, then you can do <code>SPC m c f</code> and it will compile the
function that you&rsquo;re currently focused on. If you want to run a sequence of expressions to test your
code, then you can select the lines for all the expressions you want to evaluate, then do <code>SPC m e r</code>
to evaluate that region.
</p>

<p>
There&rsquo;s tons more things that you can do, all of the hotkeys are available to look at by hitting
<code>SPC m</code> and then waiting a second to see all the possible hotkeys show up at the bottom of the frame. 
</p>
</div>
</div>

<div id="outline-container-org94abf4b" class="outline-3">
<h3 id="org94abf4b">Visual Studio Code</h3>
<div class="outline-text-3" id="text-org94abf4b">
<p>
Visual Studio Code is probably what most people use for this course. It won&rsquo;t have as good of
support as Emacs, but it will be easier to use.
</p>

<p>
To install Visual Studio Code you can go to it&rsquo;s <a href="https://code.visualstudio.com/Download">website and download</a> from there.
</p>

<p>
<b>Sidenote: VSCode without the telemetry</b>
The source code for Visual Studio Code is free and open source, <i>however</i> the binaries that Microsoft
releases on their website are under a different license and have telemetry and reporting software
bundled in. If you don&rsquo;t like that, you can download pre-built binaries of vscode <i>without</i> the
telemetry from the <a href="https://github.com/VSCodium/vscodium/releases">vscodium</a> project. VSCodium is the <i>exact same thing</i> just without the telemetry.
Everything in this guide is the exact same for both vscode and vscodium.
</p>

<p>
For writing Lisp in vscode, there&rsquo;s 3 primary extensions that I would recommend installing. 
</p>
<ol class="org-ol">
<li><a href="https://marketplace.visualstudio.com/items?itemName=mattn.Lisp">Syntax highlighting</a>
Gotta have syntax highlighting, right?</li>
<li><a href="https://marketplace.visualstudio.com/items?itemName=2gua.rainbow-brackets">Rainbow Brackets</a>
This will help make your code much more legible by highlighting each level of parentheses a
different colour, which helps you see matching parentheses more easily.</li>
<li><p>
<a href="https://marketplace.visualstudio.com/items?itemName=shaunlebron.vscode-parinfer">parinfer</a>
This plugin helps make writing Lisp code feel more like Python. It automatically managers your
parentheses for you based on the indentation of your code. Which a) means you don&rsquo;t have to
manage them yourself and b) forces your code to be formatted properly. 
</p>

<p>
With these installed, there&rsquo;s two ways that you can execute your code from inside vscode - either
  using the terminal, or telling vscode how to execute it with a run button.
</p></li>
</ol>
</div>

<div id="outline-container-org7334290" class="outline-4">
<h4 id="org7334290">Terminal</h4>
<div class="outline-text-4" id="text-org7334290">
<p>
Running your code from the terminal will be the same no matter what editor you&rsquo;re using. With vscode
you can use the buitl-in terminal and follow the instructions about <a href="lisp-running-from-terminal.html">running lisp from your terminal</a>
I wrote on another page.
</p>
</div>
</div>

<div id="outline-container-org9ae43bc" class="outline-4">
<h4 id="org9ae43bc">Integrated into vscode</h4>
<div class="outline-text-4" id="text-org9ae43bc">
<p>
First, make your assignment directory the root of a new workspace in vscode. Then, create a
directory named <code>.vscode</code>. Inside that directory, you should make a new file called <code>tasks.json</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash">--- assignment/
  |--- .vscode/
  |  |--- tasks.json
  |--- file-1.lisp
  |--- file-2.lisp
</pre>
</div>

<p>
Inside your <code>tasks.json</code> file, put the following content:
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">See https://go.microsoft.com/fwlink/?LinkId=733558</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">for the documentation about the tasks.json format</span>
  <span style="color: #98be65;">"version"</span>: <span style="color: #98be65;">"2.0.0"</span>,
  <span style="color: #98be65;">"tasks"</span>: [
      {
          <span style="color: #98be65;">"label"</span>: <span style="color: #98be65;">"sbcl"</span>,
          <span style="color: #98be65;">"type"</span>: <span style="color: #98be65;">"shell"</span>,
          <span style="color: #98be65;">"command"</span>: <span style="color: #98be65;">"sbcl --script ${file}"</span>,
          <span style="color: #98be65;">"problemMatcher"</span>: [],
          <span style="color: #98be65;">"group"</span>: {
              <span style="color: #98be65;">"kind"</span>: <span style="color: #98be65;">"build"</span>,
              <span style="color: #98be65;">"isDefault"</span>: <span style="color: #a9a1e1;">true</span>
          }
      }
  ]
}
</pre>
</div>

<p>
Now, if you enter some code into <code>file.lisp</code> and hit they hotkey <code>ctrl+shift+b</code>, to execute your code,
then vscode will open a new panel to show you the output.
</p>
</div>
</div>
</div>

<div id="outline-container-orgad73dbe" class="outline-3">
<h3 id="orgad73dbe">Atom</h3>
<div class="outline-text-3" id="text-orgad73dbe">
<p>
Atom is another popular editor that people use for this class and it has pretty decent support for
Common Lisp.
</p>

<p>
For writing Lisp in Atom, there&rsquo;s 4 primary extensions that I would recommend installing. 
</p>
<ol class="org-ol">
<li><a href="https://atom.io/packages/language-lisp">Syntax highlighting</a>
Gotta have syntax highlighting, right?</li>
<li><a href="https://atom.io/packages/prismatic-parens">Rainbow Brackets</a>
This will help make your code much more legible by highlighting each level of parentheses a
different colour, which helps you see matching parentheses more easily.</li>
<li><a href="https://atom.io/packages/parinfer">parinfer</a>
This plugin helps make writing Lisp code feel more like Python. It automatically managers your
parentheses for you based on the indentation of your code. Which a) means you don&rsquo;t have to
manage them yourself and b) forces your code to be formatted properly.</li>
<li><a href="https://atom.io/packages/slima">SLIMA</a>
The Superior Lisp Interaction Mode for Atom. Very heavily inspired from a similar plugin for
Emacs, it&rsquo;s probably the best way to run Lisp code inside Atom.</li>
</ol>

<p>
With these installed, there&rsquo;s two ways that you can execute your code from inside vscode - either
using the terminal, or through SLIMA.
</p>

<p>
I&rsquo;ve never used SLIMA before however, so I would recommend that you read through the page for it
linked about that guides you through setting it up and using it.
</p>
</div>
</div>

<div id="outline-container-orgdeb91ac" class="outline-3">
<h3 id="orgdeb91ac">Vim</h3>
<div class="outline-text-3" id="text-orgdeb91ac">
<p>
Vim isn&rsquo;t a super popular editor for students in this class, but if you use Vim then you use Vim.
</p>

<p>
For writing Lisp in Vim, there&rsquo;s 3 primary extensions that I would recommend installing. 
</p>
<ol class="org-ol">
<li><a href="https://github.com/luochen1990/rainbow">Rainbow Brackets</a>
This will help make your code much more legible by highlighting each level of parentheses a
different colour, which helps you see matching parentheses more easily.</li>
<li><a href="https://github.com/bhurlow/vim-parinfer">parinfer</a>
This plugin helps make writing Lisp code feel more like Python. It automatically managers your
parentheses for you based on the indentation of your code. Which a) means you don&rsquo;t have to
manage them yourself and b) forces your code to be formatted properly.</li>
<li><p>
<a href="https://www.vim.org/scripts/script.php?script_id=2531">SLIMV</a>
The Superior Lisp Interaction Mode for Vim. Very heavily inspired from a similar plugin for
Emacs, it&rsquo;s probably the best way to run Lisp code inside Vim.
</p>

<p>
Note that I am not a vimmer myself and have no idea how well these plugins work.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgdd08a63" class="outline-3">
<h3 id="orgdd08a63">Portacle</h3>
<div class="outline-text-3" id="text-orgdd08a63">
<p>
Surprise! Portacle is actually just Emacs! Scroll back up to my recommendations for using Emacs
instead of using Portacle right out of the box.
</p>
</div>
</div>

<div id="outline-container-orga567c39" class="outline-3">
<h3 id="orga567c39">Other</h3>
<div class="outline-text-3" id="text-orga567c39">
<p>
At the end of the day, any text editor will work for writing your Lisp code. Notepad++, Sublime,
etc. If you use any of these other editors though, I&rsquo;d highly recommend taking some time to figure
out what the best plugins for working with Lisp are because it will really be helpful.
</p>

<p>
Unless you find a plugin that supports executing code from the editor, you&rsquo;ll also probably need to
learn to compile your lisp code in the terminal/command line. I&rsquo;d recommend
<a href="lisp-running-from-terminal.html">reading about running from the terminal</a> to familiarize yourself with the commands.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2020-10-30 Fri 02:29</p>
</div>
</body>
</html>
